Revit 2024 API
SpatialElementGeometryCalculator.CalculateSpatialElementGeometry Method
 Compute the spatial element geometry and returns the boundary face information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SpatialElementGeometryResults CalculateSpatialElementGeometry(
	SpatialElement spatialElement
)
Visual Basic
Public Function CalculateSpatialElementGeometry ( _
	spatialElement As SpatialElement _
) As SpatialElementGeometryResults
Visual C++
public:
SpatialElementGeometryResults^ CalculateSpatialElementGeometry(
	SpatialElement^ spatialElement
)
Parameters
spatialElement
Type: Autodesk.Revit.DB.SpatialElement
 Specifies the spatial element needs to be computed, should be Room or Space.
Return Value
 Requested boundary face information.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  spatialElement is not a room or a space, and thus has no 3D geometry to calculate. -or- spatialElement is not enclosed in 2d or has no location, or the height is too small, and thus has no 3D geometry to calculate.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to compute the given spatial element's geometry.
See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace